; domain
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (domain sailing)
     (:requirements :typing :fluents)
     (:types
          boat person - object
     )
     (:predicates
          (saved ?t - person)
     )
     (:functions
          (x ?b - boat)
          (y ?b - boat)
          (d ?t - person)
     )
     ;; Increment the value in the given counter by one
     (:action go_north_east
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_north_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_est
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 3))
     )
     (:action go_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 3))
     )
     (:action go_south_west
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south_east
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south
          :parameters(?b - boat)
          :precondition (and)
          :effect (and (decrease (y ?b) 2))
     )
     (:action save_person
          :parameters(?b - boat ?t - person)
          :precondition ( and (>= (+ (x ?b) (y ?b)) (d ?t))
               (>= (- (y ?b) (x ?b)) (d ?t))
               (<= (+ (x ?b) (y ?b)) (+ (d ?t) 25))
               (<= (- (y ?b) (x ?b)) (+ (d ?t) 25))
          )
          :effect (and(saved ?t))
     )

)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_10_14)

	(:domain sailing)

	(:objects
		b0 b1 b2 b3 b4 b5 b6 b7 b8 b9 - boat
		p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 - person
	)

  (:init
		(= (x b0) -1)
(= (y b0) 0)
(= (x b1) -7)
(= (y b1) 0)
(= (x b2) 4)
(= (y b2) 0)
(= (x b3) -9)
(= (y b3) 0)
(= (x b4) 3)
(= (y b4) 0)
(= (x b5) 0)
(= (y b5) 0)
(= (x b6) -9)
(= (y b6) 0)
(= (x b7) 8)
(= (y b7) 0)
(= (x b8) 10)
(= (y b8) 0)
(= (x b9) -9)
(= (y b9) 0)

		(= (d p0) 96)
(= (d p1) 61)
(= (d p2) 8)
(= (d p3) 93)
(= (d p4) 60)
(= (d p5) 21)
(= (d p6) 27)
(= (d p7) 42)
(= (d p8) 96)
(= (d p9) 32)
(= (d p10) 39)
(= (d p11) 94)
(= (d p12) 40)
(= (d p13) 67)

	)

	(:goal
		(and
			(saved p0)
(saved p1)
(saved p2)
(saved p3)
(saved p4)
(saved p5)
(saved p6)
(saved p7)
(saved p8)
(saved p9)
(saved p10)
(saved p11)
(saved p12)
(saved p13)
		)
	)
)

; plan
1. (go_north_east b5)
   changed: (x b5) from 0 to 1.5, (y b5) from 0 to 1.5
   goals met: 0 of 14
2. (go_north_east b5)
   changed: (x b5) from 1.5 to 3, (y b5) from 1.5 to 3
   goals met: 0 of 14
3. (go_north_east b5)
   changed: (x b5) from 3 to 4.5, (y b5) from 3 to 4.5
   goals met: 0 of 14
4. (go_north_east b5)
   changed: (x b5) from 4.5 to 6, (y b5) from 4.5 to 6
   goals met: 0 of 14
5. (go_north_east b5)
   changed: (x b5) from 6 to 7.5, (y b5) from 6 to 7.5
   goals met: 0 of 14
6. (go_north_east b5)
   changed: (x b5) from 7.5 to 9, (y b5) from 7.5 to 9
   goals met: 0 of 14
7. (go_north_east b5)
   changed: (x b5) from 9 to 10.5, (y b5) from 9 to 10.5
   goals met: 0 of 14
8. (go_north_east b5)
   changed: (x b5) from 10.5 to 12, (y b5) from 10.5 to 12
   goals met: 0 of 14
9. (go_north_east b5)
   changed: (x b5) from 12 to 13.5, (y b5) from 12 to 13.5
   goals met: 0 of 14
10. (go_north_east b5)
   changed: (x b5) from 13.5 to 15, (y b5) from 13.5 to 15
   goals met: 0 of 14
11. (go_north_east b5)
   changed: (x b5) from 15 to 16.5, (y b5) from 15 to 16.5
   goals met: 0 of 14
12. (go_north_west b5)
   changed: (x b5) from 16.5 to 15, (y b5) from 16.5 to 18
   goals met: 0 of 14
13. (go_north_west b5)
   changed: (x b5) from 15 to 13.5, (y b5) from 18 to 19.5
   goals met: 0 of 14
14. (go_north_west b5)
   changed: (x b5) from 13.5 to 12, (y b5) from 19.5 to 21
   goals met: 0 of 14
15. (save_person b5 p2)
   added: (saved p2)
   goals met: 1 of 14
16. (go_north_east b5)
   changed: (x b5) from 12 to 13.5, (y b5) from 21 to 22.5
   goals met: 1 of 14
17. (go_north_east b5)
   changed: (x b5) from 13.5 to 15, (y b5) from 22.5 to 24
   goals met: 1 of 14
18. (go_north_east b5)
   changed: (x b5) from 15 to 16.5, (y b5) from 24 to 25.5
   goals met: 1 of 14
19. (go_north_east b5)
   changed: (x b5) from 16.5 to 18, (y b5) from 25.5 to 27
   goals met: 1 of 14
20. (go_north_east b5)
   changed: (x b5) from 18 to 19.5, (y b5) from 27 to 28.5
   goals met: 1 of 14
21. (go_north_east b5)
   changed: (x b5) from 19.5 to 21, (y b5) from 28.5 to 30
   goals met: 1 of 14
22. (go_north_east b5)
   changed: (x b5) from 21 to 22.5, (y b5) from 30 to 31.5
   goals met: 1 of 14
23. (go_north_east b5)
   changed: (x b5) from 22.5 to 24, (y b5) from 31.5 to 33
   goals met: 1 of 14
24. (go_north_east b5)
   changed: (x b5) from 24 to 25.5, (y b5) from 33 to 34.5
   goals met: 1 of 14
25. (go_west b5)
   changed: (x b5) from 25.5 to 22.5
   goals met: 1 of 14
26. (go_west b5)
   changed: (x b5) from 22.5 to 19.5
   goals met: 1 of 14
27. (go_west b5)
   changed: (x b5) from 19.5 to 16.5
   goals met: 1 of 14
28. (go_west b5)
   changed: (x b5) from 16.5 to 13.5
   goals met: 1 of 14
29. (go_west b5)
   changed: (x b5) from 13.5 to 10.5
   goals met: 1 of 14
30. (save_person b5 p5)
   added: (saved p5)
   goals met: 2 of 14
31. (go_north_east b5)
   changed: (x b5) from 10.5 to 12, (y b5) from 34.5 to 36
   goals met: 2 of 14
32. (go_north_east b5)
   changed: (x b5) from 12 to 13.5, (y b5) from 36 to 37.5
   goals met: 2 of 14
33. (go_north_east b5)
   changed: (x b5) from 13.5 to 15, (y b5) from 37.5 to 39
   goals met: 2 of 14
34. (go_north_east b5)
   changed: (x b5) from 15 to 16.5, (y b5) from 39 to 40.5
   goals met: 2 of 14
35. (go_north_east b5)
   changed: (x b5) from 16.5 to 18, (y b5) from 40.5 to 42
   goals met: 2 of 14
36. (go_north_west b5)
   changed: (x b5) from 18 to 16.5, (y b5) from 42 to 43.5
   goals met: 2 of 14
37. (go_north_west b5)
   changed: (x b5) from 16.5 to 15, (y b5) from 43.5 to 45
   goals met: 2 of 14
38. (go_north_west b5)
   changed: (x b5) from 15 to 13.5, (y b5) from 45 to 46.5
   goals met: 2 of 14
39. (go_north_west b5)
   changed: (x b5) from 13.5 to 12, (y b5) from 46.5 to 48
   goals met: 2 of 14
40. (go_north_west b5)
   changed: (x b5) from 12 to 10.5, (y b5) from 48 to 49.5
   goals met: 2 of 14
41. (save_person b5 p10)
   added: (saved p10)
   goals met: 3 of 14
42. (go_north_west b5)
   changed: (x b5) from 10.5 to 9, (y b5) from 49.5 to 51
   goals met: 3 of 14
43. (save_person b5 p7)
   added: (saved p7)
   goals met: 4 of 14
44. (save_person b5 p12)
   added: (saved p12)
   goals met: 5 of 14
45. (go_north_west b5)
   changed: (x b5) from 9 to 7.5, (y b5) from 51 to 52.5
   goals met: 5 of 14
46. (go_north_west b5)
   changed: (x b5) from 7.5 to 6, (y b5) from 52.5 to 54
   goals met: 5 of 14
47. (go_north_west b5)
   changed: (x b5) from 6 to 4.5, (y b5) from 54 to 55.5
   goals met: 5 of 14
48. (go_west b5)
   changed: (x b5) from 4.5 to 1.5
   goals met: 5 of 14
49. (go_west b5)
   changed: (x b5) from 1.5 to -1.5
   goals met: 5 of 14
50. (go_west b5)
   changed: (x b5) from -1.5 to -4.5
   goals met: 5 of 14
51. (go_north_east b5)
   changed: (x b5) from -4.5 to -3, (y b5) from 55.5 to 57
   goals met: 5 of 14
52. (go_north_east b5)
   changed: (x b5) from -3 to -1.5, (y b5) from 57 to 58.5
   goals met: 5 of 14
53. (go_north_east b5)
   changed: (x b5) from -1.5 to 0, (y b5) from 58.5 to 60
   goals met: 5 of 14
54. (save_person b5 p4)
   added: (saved p4)
   goals met: 6 of 14
55. (go_north_east b5)
   changed: (x b5) from 0 to 1.5, (y b5) from 60 to 61.5
   goals met: 6 of 14
56. (go_north_west b5)
   changed: (x b5) from 1.5 to 0, (y b5) from 61.5 to 63
   goals met: 6 of 14
57. (save_person b5 p1)
   added: (saved p1)
   goals met: 7 of 14
58. (go_north_east b5)
   changed: (x b5) from 0 to 1.5, (y b5) from 63 to 64.5
   goals met: 7 of 14
59. (go_north_west b5)
   changed: (x b5) from 1.5 to 0, (y b5) from 64.5 to 66
   goals met: 7 of 14
60. (go_north_west b5)
   changed: (x b5) from 0 to -1.5, (y b5) from 66 to 67.5
   goals met: 7 of 14
61. (go_north_west b5)
   changed: (x b5) from -1.5 to -3, (y b5) from 67.5 to 69
   goals met: 7 of 14
62. (go_north_east b5)
   changed: (x b5) from -3 to -1.5, (y b5) from 69 to 70.5
   goals met: 7 of 14
63. (save_person b5 p13)
   added: (saved p13)
   goals met: 8 of 14
64. (go_south_east b5)
   changed: (x b5) from -1.5 to -3.5, (y b5) from 70.5 to 68.5
   goals met: 8 of 14
65. (go_south_east b5)
   changed: (x b5) from -3.5 to -5.5, (y b5) from 68.5 to 66.5
   goals met: 8 of 14
66. (go_south_east b5)
   changed: (x b5) from -5.5 to -7.5, (y b5) from 66.5 to 64.5
   goals met: 8 of 14
67. (go_south_west b5)
   changed: (x b5) from -7.5 to -5.5, (y b5) from 64.5 to 62.5
   goals met: 8 of 14
68. (go_south_west b5)
   changed: (x b5) from -5.5 to -3.5, (y b5) from 62.5 to 60.5
   goals met: 8 of 14
69. (go_south_west b5)
   changed: (x b5) from -3.5 to -1.5, (y b5) from 60.5 to 58.5
   goals met: 8 of 14
70. (go_south_west b5)
   changed: (x b5) from -1.5 to 0.5, (y b5) from 58.5 to 56.5
   goals met: 8 of 14
71. (save_person b5 p9)
   added: (saved p9)
   goals met: 9 of 14
72. (go_north_east b5)
   changed: (x b5) from 0.5 to 2, (y b5) from 56.5 to 58
   goals met: 9 of 14
73. (go_north_east b5)
   changed: (x b5) from 2 to 3.5, (y b5) from 58 to 59.5
   goals met: 9 of 14
74. (go_north_east b5)
   changed: (x b5) from 3.5 to 5, (y b5) from 59.5 to 61
   goals met: 9 of 14
75. (go_north_east b5)
   changed: (x b5) from 5 to 6.5, (y b5) from 61 to 62.5
   goals met: 9 of 14
76. (go_north_east b5)
   changed: (x b5) from 6.5 to 8, (y b5) from 62.5 to 64
   goals met: 9 of 14
77. (go_north_east b5)
   changed: (x b5) from 8 to 9.5, (y b5) from 64 to 65.5
   goals met: 9 of 14
78. (go_north_east b5)
   changed: (x b5) from 9.5 to 11, (y b5) from 65.5 to 67
   goals met: 9 of 14
79. (go_north_east b5)
   changed: (x b5) from 11 to 12.5, (y b5) from 67 to 68.5
   goals met: 9 of 14
80. (go_north_east b5)
   changed: (x b5) from 12.5 to 14, (y b5) from 68.5 to 70
   goals met: 9 of 14
81. (go_north_west b5)
   changed: (x b5) from 14 to 12.5, (y b5) from 70 to 71.5
   goals met: 9 of 14
82. (go_north_west b5)
   changed: (x b5) from 12.5 to 11, (y b5) from 71.5 to 73
   goals met: 9 of 14
83. (go_north_west b5)
   changed: (x b5) from 11 to 9.5, (y b5) from 73 to 74.5
   goals met: 9 of 14
84. (go_north_west b5)
   changed: (x b5) from 9.5 to 8, (y b5) from 74.5 to 76
   goals met: 9 of 14
85. (go_north_west b5)
   changed: (x b5) from 8 to 6.5, (y b5) from 76 to 77.5
   goals met: 9 of 14
86. (go_north_west b5)
   changed: (x b5) from 6.5 to 5, (y b5) from 77.5 to 79
   goals met: 9 of 14
87. (go_north_west b5)
   changed: (x b5) from 5 to 3.5, (y b5) from 79 to 80.5
   goals met: 9 of 14
88. (go_north_west b5)
   changed: (x b5) from 3.5 to 2, (y b5) from 80.5 to 82
   goals met: 9 of 14
89. (go_north_west b5)
   changed: (x b5) from 2 to 0.5, (y b5) from 82 to 83.5
   goals met: 9 of 14
90. (go_north_west b5)
   changed: (x b5) from 0.5 to -1, (y b5) from 83.5 to 85
   goals met: 9 of 14
91. (go_north_east b5)
   changed: (x b5) from -1 to 0.5, (y b5) from 85 to 86.5
   goals met: 9 of 14
92. (go_north_east b5)
   changed: (x b5) from 0.5 to 2, (y b5) from 86.5 to 88
   goals met: 9 of 14
93. (go_north_east b5)
   changed: (x b5) from 2 to 3.5, (y b5) from 88 to 89.5
   goals met: 9 of 14
94. (go_north_east b0)
   changed: (x b0) from -1 to 0.5, (y b0) from 0 to 1.5
   goals met: 9 of 14
95. (go_north_east b0)
   changed: (x b0) from 0.5 to 2, (y b0) from 1.5 to 3
   goals met: 9 of 14
96. (go_north_east b0)
   changed: (x b0) from 2 to 3.5, (y b0) from 3 to 4.5
   goals met: 9 of 14
97. (go_north_east b0)
   changed: (x b0) from 3.5 to 5, (y b0) from 4.5 to 6
   goals met: 9 of 14
98. (go_north_east b0)
   changed: (x b0) from 5 to 6.5, (y b0) from 6 to 7.5
   goals met: 9 of 14
99. (go_north_east b0)
   changed: (x b0) from 6.5 to 8, (y b0) from 7.5 to 9
   goals met: 9 of 14
100. (go_north_east b0)
   changed: (x b0) from 8 to 9.5, (y b0) from 9 to 10.5
   goals met: 9 of 14
101. (go_north_east b0)
   changed: (x b0) from 9.5 to 11, (y b0) from 10.5 to 12
   goals met: 9 of 14
102. (go_north_east b0)
   changed: (x b0) from 11 to 12.5, (y b0) from 12 to 13.5
   goals met: 9 of 14
103. (go_north_east b0)
   changed: (x b0) from 12.5 to 14, (y b0) from 13.5 to 15
   goals met: 9 of 14
104. (go_north_west b5)
   changed: (x b5) from 3.5 to 2, (y b5) from 89.5 to 91
   goals met: 9 of 14
105. (go_north_west b5)
   changed: (x b5) from 2 to 0.5, (y b5) from 91 to 92.5
   goals met: 9 of 14
106. (go_north_west b5)
   changed: (x b5) from 0.5 to -1, (y b5) from 92.5 to 94
   goals met: 9 of 14
107. (save_person b5 p3)
   added: (saved p3)
   goals met: 10 of 14
108. (go_north_west b0)
   changed: (x b0) from 14 to 12.5, (y b0) from 15 to 16.5
   goals met: 10 of 14
109. (go_north_west b0)
   changed: (x b0) from 12.5 to 11, (y b0) from 16.5 to 18
   goals met: 10 of 14
110. (go_north_west b0)
   changed: (x b0) from 11 to 9.5, (y b0) from 18 to 19.5
   goals met: 10 of 14
111. (go_north_west b0)
   changed: (x b0) from 9.5 to 8, (y b0) from 19.5 to 21
   goals met: 10 of 14
112. (go_north_west b0)
   changed: (x b0) from 8 to 6.5, (y b0) from 21 to 22.5
   goals met: 10 of 14
113. (go_north_west b0)
   changed: (x b0) from 6.5 to 5, (y b0) from 22.5 to 24
   goals met: 10 of 14
114. (go_north_west b0)
   changed: (x b0) from 5 to 3.5, (y b0) from 24 to 25.5
   goals met: 10 of 14
115. (go_north_west b0)
   changed: (x b0) from 3.5 to 2, (y b0) from 25.5 to 27
   goals met: 10 of 14
116. (go_north_west b0)
   changed: (x b0) from 2 to 0.5, (y b0) from 27 to 28.5
   goals met: 10 of 14
117. (save_person b0 p6)
   added: (saved p6)
   goals met: 11 of 14
118. (go_north_east b5)
   changed: (x b5) from -1 to 0.5, (y b5) from 94 to 95.5
   goals met: 11 of 14
119. (save_person b5 p11)
   added: (saved p11)
   goals met: 12 of 14
120. (go_north_west b5)
   changed: (x b5) from 0.5 to -1, (y b5) from 95.5 to 97
   goals met: 12 of 14
121. (save_person b5 p8)
   added: (saved p8)
   goals met: 13 of 14
122. (save_person b5 p0)
   added: (saved p0)
   goals met: 14 of 14
